app/controllers/posts_controller.rb

  def index
    @posts = Post.all
---
SELECT * FROM `posts`

  def show
    @post = Post.find(params[:id])
---
SELECT * FROM `posts` WHERE (`posts`.`id` = 1)

  def edit
    @post = Post.find(params[:id])
---
SELECT * FROM `posts` WHERE (`posts`.`id` = 1)

  def create
    @post = Post.new(params[:post])

    respond_to do |format|
      if @post.save
---
INSERT INTO `posts` (`updated_at`, `title`, `body`, `created_at`) VALUES('2009-05-18 21:31:49', 'TeamJL: What\'s TeamJL?', '\r\n\r\nI’ve got some time to kill as I wait for team-mates to show up, so here is a quick intro to TeamJL.\r\n\r\nTeamJL is short for Jesus Lives. We are a Competitive, Christ-Centered Gaming team. I’ll explain the terms in our context.\r\n\r\n * Competitive: We are gamers, but we take gaming seriously. We play in online leagues, tournaments, anyplace we can find good competition.\r\n * Christ-Centered: While we take gaming seriously, we do it in a Christ-like manner, and try to create a healthy, God honoring atmosphere to game in.\r\n\r\nOur vision is to:\r\n\r\n “Help change the world by leading gamers to become fully devoted followers of Christ.”\r\n\r\n (adapted from Campus for Christ’s and LifeChurch.tv’s vision)\r\n\r\nHope this post was a little enlightening. Questions? Please comment! Off to game now, String out.\r\n', '2009-05-18 21:31:49')

  def update
    @post = Post.find(params[:id])

    respond_to do |format|
      if @post.update_attributes(params[:post])
---
SELECT * FROM `posts` WHERE (`posts`.`id` = 1)
UPDATE `posts` SET `body` = 'I’ve got some time to kill as I wait for team-mates to show up, so here is a quick intro to TeamJL.\r\n\r\nTeamJL is short for Jesus Lives. We are a Competitive, Christ-Centered Gaming team. I’ll explain the terms in our context.\r\n\r\n * Competitive: We are gamers, but we take gaming seriously. We play in online leagues, tournaments, anyplace we can find good competition.\r\n * Christ-Centered: While we take gaming seriously, we do it in a Christ-like manner, and try to create a healthy, God honoring atmosphere to game in.\r\n\r\nOur vision is to:\r\n\r\n “Help change the world by leading gamers to become fully devoted followers of Christ.”\r\n\r\n (adapted from Campus for Christ’s and LifeChurch.tv’s vision)\r\n\r\nHope this post was a little enlightening. Questions? Please comment! Off to game now, String out.\r\n', `updated_at` = '2009-05-18 21:34:39' WHERE `id` = 1